InformationRegisters/ОчередьПечатиККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьПечатиККМ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекВодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекЗадание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекРеализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Деньги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаПостановкиВОчередь</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументЧек</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыКассовойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыКассовойСмены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РаботаСККМ/Ext/Module.bsl
Процедура ПечатьЧека(Документ) Экспорт
	ФУ = Неопределено;
	
	Форма = Документ.ПолучитьФорму("ФормаДокумента");
	ПолучитьСерверТО().ПодключитьКлиента(Форма);

	Если Не РаботаСТорговымОборудованием.ПолучитьПроверитьПараметрыДляПробитияЧека(ФУ, Истина, Документ.Организация) Тогда
		Возврат;
	КонецЕсли;
		
	ОписаниеПКС = КассовыеСменыВызовСервера.ОписаниеПоследнейКассовойСмены(ФУ);
	Если ОписаниеПКС = Неопределено ИЛИ ОписаниеПКС.Статус = Перечисления.СтатусыКассовойСмены.Закрыта Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Кассовая смена не открыта");
		Возврат;
	КонецЕсли;

	ОбъектДрайвера = Неопределено;
	ОбработкаОбслуживания = Неопределено;
	ПолучитьСерверТО().ПолучитьОбъектДрайвера(ФУ, ОбработкаОбслуживания, ОбъектДрайвера);
	
	ОбработкаОбслуживания.ПолучитьПараметрыККТ(ОбъектДрайвера);
	ВерсияФормата = МенеджерОборудованияКлиентСервер.ВерсияФФД(ОбъектДрайвера.ВыходныеПараметры);
	
	ПараметрыЧека = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
	ПараметрыЧека.Вставить("ОписаниеПКС", ОписаниеПКС);
	МенеджерОборудованияВызовСервера.ПодготовитьДанныеДляФискализацииЧека(Документ.Ссылка, ПараметрыЧека, ВерсияФормата, 
		ПолучитьСерверТО().ПолучитьМодель(ФУ), Документ.ПринятоОт, Документ.Основание);
	
	ОшибкаТО = ОбработкаОбслуживания.ФискализироватьЧек(ОбъектДрайвера, ПараметрыЧека);
	Если ЗначениеЗаполнено(ОшибкаТО) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(ОбъектДрайвера.ОписаниеОшибки);
		Возврат;
		//Иначе
		//	ЭтотОбъект.НомерЧекаККМ = ОбъектДрайвера.ВыходныеПараметры[1];
		//	ЭтотОбъект.ККМ = ОписаниеПКС.КассаККМ;
		//	ЭтотОбъект.ТекстЭлектронногоЧека = ПараметрыЧека.ТекстЭлектронногоЧека;
	КонецЕсли;

	ПолучитьСерверТО().ОтключитьКлиента(Форма);


	
КонецПроцедуры

Процедура ПриОткрытии()
	ПодключитьОбработчикОжидания("ПечатьЧека", 10); 
КонецПроцедуры

Процедура ПечатьЧеков() Экспорт

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		ЗаписьЖурналаРегистрации("Печать чеков ККМ", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1 *
	|ИЗ
	|	РегистрСведений.ОчередьПечатиККМ КАК ОчередьПечатиККМ
	|ГДЕ
	|	ОчередьПечатиККМ.Обработано = ЛОЖЬ
	|	И ОчередьПечатиККМ.ДокументЧек <> ЗНАЧЕНИЕ(Документ.ПриходныйКассовыйОрдер.ПустаяСсылка)
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.ОчередьПечатиККМ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
			
		РаботаСККМ.ПечатьЧека(Выборка.ДокументЧек);
		МЗ = РегистрыСведений.ОчередьПечатиККМ.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка);
		МЗ.Обработано = Истина;
		МЗ.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
